In [1]:
import pandas as pd

In [2]:
car = ['BMW', "Benz", "Opel", "Hyundai"]
vehicle = pd.Series(car, name='vehicle')
vehicle

0        BMW
1       Benz
2       Opel
3    Hyundai
Name: vehicle, dtype: object

In [93]:
df = pd.DataFrame(
    {
        "Name": [
            "Ali", "Amin", "Farahnaz", "Mohammad"
        ],
        "Age": [60, 28, 47, 25],
        "Gender": ["m", "m", "f", None],
        "Color": ["red", None, "Green", "Orange"],
        "Bank": [2000, 1400, 1800, 1400]
    }
)

In [22]:
df.describe()

             Age        Bank
count   4.000000     4.00000
mean   40.000000  2175.00000
std    16.512621   842.12034
min    25.000000  1400.00000
25%    27.250000  1475.00000
50%    37.500000  2150.00000
75%    50.250000  2850.00000
max    60.000000  3000.00000

In [46]:
df.loc[[1]]

   Name  Age Gender Color  Bank
1  Amin   28      m  blue  1500

In [52]:
df.drop(3, inplace=True)

In [55]:
df

       Name  Age Gender   Color  Bank
0       Ali   60      m     red  3000
1      Amin   28      m    blue  1500
2  Farahnaz   47      f   Green  2800
3  Mohammad   25      m  Orange  1400

In [56]:
df.columns

Index(['Name', 'Age', 'Gender', 'Color', 'Bank'], dtype='object')

In [60]:
df_10 = df[df['Age'] > 25]
df_10.tail()

       Name  Age Gender  Color  Bank
0       Ali   60      m    red  3000
1      Amin   28      m   blue  1500
2  Farahnaz   47      f  Green  2800

In [66]:
df.mean()

/tmp/ipykernel_6766/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       40.000000
Bank    2433.333333
dtype: float64

In [67]:
df.count()

Name      4
Age       4
Gender    3
Color     3
Bank      3
dtype: int64

In [77]:
df.cov()

              Age          Bank
Age    272.666667   4533.333333
Bank  4533.333333  75833.333333

In [87]:
df['Date Birth'] = 2021 - df['Age']
df.sort_values('Bank')

       Name  Age Gender   Color  Bank  Date Birth
3  Mohammad   25   None  Orange  1400        1996
1      Amin   28      m    None  1500        1993
2  Farahnaz   47      f   Green  1800        1974
0       Ali   60      m     red  2000        1961

In [94]:
df['Bank'].value_counts()

1400    2
2000    1
1800    1
Name: Bank, dtype: int64

In [126]:
df.groupby('Bank')['Age'].agg(lambda x: str(2021 - x))

Bank
1400    1    1993\n3    1996\nName: Age, dtype: int64
1800               2    1974\nName: Age, dtype: int64
2000               0    1961\nName: Age, dtype: int64
Name: Age, dtype: object